The id of the run to which this element belongs.
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ElementId RunId { get; }
  Visual Basic
Public ReadOnly Property RunId As ElementId
	Get
  Visual C++
public:
property ElementId^ RunId {
	ElementId^ get ();
}
 See Also
  CableTrayConduitBase Class
  Autodesk.Revit.DB.Electrical Namespace